#დავალება: მომხმარებელს შემოატანინეთ რიცხვი, შემდეგ კი for ლუპის დახმარებით გავლეთ დიაპაზონი მომხმარებლის შემოტანილ რიცხვამდე.
num=int(input("plese enter a number:"))
for i in range(num,1,1):
    print(num)

#დავალება: 10-დან 20-მდე გამოტანეთ ყველა რიცხვი, while ციკლის დახმარებით

i = 10
while i < 20:
    i=i+1
    print(i)

    
#დავალება: while ციკლის დახმარებით გამოტანეთ 0-დან 100-მდე, მხოლოდ ლუწი რიცხვები

x=0
while x < 100:
    x=x+1
    print(x)


#დავალება: მომხმარებესლ შემოატანინეთ სახელი, მომხმარებლის სახელი თუ არ უდრის თქვენს სახელს, კიდევ გაიმეოროს კითხა, თუ უდიან 
# მომხმარებლის შემოტანილი სახელი და თქვენი სახელი, მაშინ გაცერდეს იტერაცია.


name=input("please enter your name:")

while name != "giorgi":
    name=input("please enter your name:")

