#1)for loop - ის დახმარებით, 126 - დან, 0 - მდე, საპირისპირო მიმართულებით 
# გამოიტანეთ რიცხვები, ჯერ 1 ნაბიჯით, შემდეგ 2 ნაბიჯით და შემდეგ 3 ნაბიჯით.(126, 125, 124 და ა.შ)

for i in range ( 126,0,-1 ):
    print(i)


    for i in range( 126,0,-2 ):
      print(i)

      for i in range(126,0,-3):
         print(i)


         
        

#2)for loop-ის საშუალებით ტერმინალში გამოიტანეთ 30-ჯერ "GOA IS THE BEST"

for i in range(50):
   print("Goa best")

   #3)for loop-ის საშუალებ ით ტერმინალში 5-დან 150-ის ჩათვლით ნომრები

   