#2)
#შექმენით 10 მთელი რიცხვების სია, რიცხვები, 1-დან 10-მდე.

#დაჭერით სია, რომ მიიღოთ პირველი 5 ელემენტი და დაბეჭდეთ ისინი.

#დაჭერით სია ბოლო 3 ელემენტის მისაღებად და დაბეჭდეთ ისინი.

#დაჭერით სია, რომ მიიღოთ ყოველი მეორე ელემენტი სიიდან და დაბეჭდეთ იგი.
 

list=[1,2,3,4,5,6,7,8,9,10]
print(list[0:5])

print(list[-3::])

print(list[0:9:2])


# 3)
#შექმენით 6 სტრიქონის სია, რომლებიც წარმოადგენენ სხვადასხვა ხილს: ['ვაშლი', 'ბანანი', 'ალუბალი', 'თარიღი', 'ლეღვი', 'ყურძენი'].  # type: ignore

#1. შეცვალეთ სია ჭრის გამოყენებით და ამობეჭდეთ შებრუნებული სია. 
#2. შეცვალეთ შუა ორი ხილი ['კივი', 'ცაცხვი'] სიის ჭრის გამოყენებით და დაბეჭდეთ განახლებული სია.

market=['ვაშლი', 'ბანანი', 'ალუბალი', 'თარიღი', 'ლეღვი', 'ყურძენი']
print(market[::-1])


market[2]='კივი'
market[3]='ცაცხვი'

print(market)
