#1)for loop-ის საშუალებით ტერმინალში გამოიტანეთ 2-დან 50-ის ჩათვლით ნომრები ოღონდ ნაბიჯი იყოს 4ანუ ყოველ i-ს თითეულ ნაბიჯზე 
# დაემატოს 4

for i in range( 50,0 ,-4 ):
    print(i)


#2) for loop-ის საშუალებით ტერმინალში გამოიტანეთ  10-ჯერ ყოველი ( i ელემენტი და გვერდით მიუწერეთ, "GOA")
#i --------- საიტერაციო ცვლადი

for i in range(10):
    print(" i goa")
    

#3) დაწერეთ პროგრამა for loop-ის გამოყენებით, რომელიც გამოგვიტანს ჯერ ლუწს და შემდეგ კენტს.
#თუ გაიაზრებთ მარტივია ძალიან. 

for i in range(2,10,2):
    for n in range(1,20,2):
     print(i,n)

    

    


#4) შექმენით პროგრამა სადაც გამოიყენებთ While loop - ს. 
#თქვენი დავალება იქნება ის, რომ მომხამრებელს შემოატანინოთ რიცხვი და თქვენ უნდა გამოიცნოთ ეს რიცხვი, ხოლო ყოველ 
# არ გამოცნობილ რიცხვზე ისევ თავიდან უნდა შეგეკითხოთ და შეიყვანოთ რიცხვი.

num1 = int(input("enter a number"))
num2 = int(input("guss the number"))
while num1 != num2:
   num2 = int(input("guss the number"))
   while num1 == num2:
      print("your number is",num2)